[{"id":"d8b40c37.7fd748","type":"tab","label":"Home","disabled":false,"info":""},{"id":"7f717486.e31e8c","type":"tab","label":"Vehicle","disabled":false,"info":""},{"id":"3e56901f.b4aac","type":"tab","label":"Settings","disabled":false,"info":""},{"id":"734e8117.dcf29","type":"tab","label":"Sensors","disabled":false,"info":""},{"id":"4a91fec4.5ed8e","type":"ui_tab","name":"Home","icon":"home","order":1,"disabled":false,"hidden":false},{"id":"a999ed30.92fee","type":"ui_base","theme":{"name":"theme-light","lightTheme":{"default":"#0094CE","baseColor":"#0094CE","baseFont":"Verdana,Verdana,Geneva,sans-serif","edited":true,"reset":false},"darkTheme":{"default":"#097479","baseColor":"#097479","baseFont":"-apple-system,BlinkMacSystemFont,Segoe UI,Roboto,Oxygen-Sans,Ubuntu,Cantarell,Helvetica Neue,sans-serif","edited":true,"reset":false},"customTheme":{"name":"Untitled Theme 1","default":"#4B7930","baseColor":"#4B7930","baseFont":"-apple-system,BlinkMacSystemFont,Segoe UI,Roboto,Oxygen-Sans,Ubuntu,Cantarell,Helvetica Neue,sans-serif"},"themeState":{"base-color":{"default":"#0094CE","value":"#0094CE","edited":false},"page-titlebar-backgroundColor":{"value":"#0094CE","edited":false},"page-backgroundColor":{"value":"#fafafa","edited":false},"page-sidebar-backgroundColor":{"value":"#ffffff","edited":false},"group-textColor":{"value":"#1bbfff","edited":false},"group-borderColor":{"value":"#ffffff","edited":false},"group-backgroundColor":{"value":"#ffffff","edited":false},"widget-textColor":{"value":"#111111","edited":false},"widget-backgroundColor":{"value":"#0094ce","edited":false},"widget-borderColor":{"value":"#ffffff","edited":false},"base-font":{"value":"Verdana,Verdana,Geneva,sans-serif"}},"angularTheme":{"primary":"indigo","accents":"blue","warn":"red","background":"grey"}},"site":{"name":"Node-RED Dashboard","hideToolbar":"true","allowSwipe":"false","lockMenu":"icon","allowTempTheme":"true","dateFormat":"DD/MM/YYYY","sizes":{"sx":40,"sy":40,"gx":0,"gy":0,"cx":0,"cy":0,"px":0,"py":0}}},{"id":"b418fe9c.51467","type":"ui_group","name":"Home","tab":"4a91fec4.5ed8e","order":1,"disp":false,"width":19,"collapse":false},{"id":"8702bca7.64e2b8","type":"ui_tab","name":"Vehicle","icon":"directions_car","order":2,"disabled":false,"hidden":false},{"id":"f3af13fb.dab4","type":"ui_group","name":"Vehicle Status","tab":"8702bca7.64e2b8","order":1,"disp":true,"width":"19","collapse":false},{"id":"4b7db33.210fecc","type":"mqtt-broker","name":"localhost","broker":"localhost","port":"1883","clientid":"","usetls":false,"protocolVersion":"4","keepalive":"60","cleansession":true,"birthTopic":"","birthQos":"0","birthPayload":"","birthMsg":{},"closeTopic":"","closeQos":"0","closePayload":"","closeMsg":{},"willTopic":"","willQos":"0","willPayload":"","willMsg":{},"sessionExpiry":""},{"id":"71e60b.4d02c1f4","type":"ui_tab","name":"Settings","icon":"settings","order":5,"disabled":false,"hidden":false},{"id":"18965cda.34db2b","type":"ui_group","name":"Settings","tab":"71e60b.4d02c1f4","order":1,"disp":true,"width":"19","collapse":false},{"id":"f783057d.1b983","type":"ui_spacer","name":"spacer","group":"f3af13fb.dab4","order":1,"width":19,"height":1},{"id":"7ad1d223.316cdc","type":"ui_spacer","name":"spacer","group":"f3af13fb.dab4","order":2,"width":19,"height":1},{"id":"c0959ffa.f7c8f8","type":"ui_spacer","name":"spacer","group":"f3af13fb.dab4","order":3,"width":19,"height":1},{"id":"3402bda8.60fce2","type":"ui_spacer","name":"spacer","group":"f3af13fb.dab4","order":4,"width":19,"height":1},{"id":"236ddca5.398bc4","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":1,"width":7,"height":1},{"id":"bd368c8c.a01238","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":3,"width":7,"height":1},{"id":"bc57280f.a9d","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":4,"width":7,"height":1},{"id":"3768a963.cb40d6","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":5,"width":7,"height":1},{"id":"8651c7b1.5a2d9","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":6,"width":19,"height":1},{"id":"9d100dc8.44a46","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":7,"width":7,"height":1},{"id":"ee8d9665.925278","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":9,"width":7,"height":1},{"id":"503e9352.47635c","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":10,"width":7,"height":1},{"id":"2bedca22.5f3c0e","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":11,"width":7,"height":1},{"id":"669b1535.d38984","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":12,"width":19,"height":1},{"id":"357cca28.441dde","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":13,"width":7,"height":1},{"id":"33972a8d.72e866","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":15,"width":7,"height":1},{"id":"e2ffaee7.3241a","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":16,"width":7,"height":1},{"id":"66ec7d96.6e4c84","type":"ui_spacer","name":"spacer","group":"18965cda.34db2b","order":17,"width":7,"height":1},{"id":"29d3ad6.45575d2","type":"ui_tab","name":"Statistics","icon":"show_chart","order":3,"disabled":false,"hidden":false},{"id":"ee517ab4.5dfed","type":"ui_group","name":"Statistics","tab":"29d3ad6.45575d2","order":1,"disp":false,"width":"19","collapse":false},{"id":"8bfebe2e.9854a8","type":"ui_group","name":"Group 1","tab":"","order":1,"disp":true,"width":6},{"id":"6d5d5f3d.8d69c8","type":"ui_media","z":"d8b40c37.7fd748","group":"b418fe9c.51467","name":"","width":13,"height":7,"order":1,"category":"Videos","file":"mandel-20210317-202939.png","layout":"expand","showcontrols":true,"loop":true,"onstart":false,"scope":"local","tooltip":"","x":930,"y":140,"wires":[[]]},{"id":"d9ab210b.8cc9a","type":"mqtt in","z":"7f717486.e31e8c","name":"bytes_sent","topic":"$SYS/broker/bytes/sent","qos":"2","datatype":"utf8","broker":"4b7db33.210fecc","nl":false,"rap":true,"rh":0,"x":480,"y":300,"wires":[["b5c455c8.7bb3c8"]]},{"id":"b5c455c8.7bb3c8","type":"ui_text","z":"7f717486.e31e8c","group":"f3af13fb.dab4","order":5,"width":0,"height":0,"name":"","label":"bytes_sent","format":"{{msg.payload}}","layout":"row-spread","x":680,"y":300,"wires":[]},{"id":"7ec5ce34.608a98","type":"ui_button","z":"3e56901f.b4aac","name":"","group":"18965cda.34db2b","order":2,"width":5,"height":2,"passthru":false,"label":"Power Off","tooltip":"","color":"","bgcolor":"#d00","icon":"power_settings_new","payload":"","payloadType":"str","topic":"topic","topicType":"msg","x":540,"y":380,"wires":[["31a3558b.6b211a"]]},{"id":"c07c2247.10585","type":"ui_button","z":"3e56901f.b4aac","name":"","group":"18965cda.34db2b","order":8,"width":5,"height":2,"passthru":false,"label":"Restart","tooltip":"","color":"","bgcolor":"","icon":"replay","payload":"","payloadType":"str","topic":"topic","topicType":"msg","x":540,"y":460,"wires":[["9f1633a2.9389b8"]]},{"id":"a0bd36fe.987c28","type":"ui_button","z":"3e56901f.b4aac","name":"","group":"18965cda.34db2b","order":14,"width":5,"height":2,"passthru":false,"label":"Exit Kiosk Mode","tooltip":"","color":"","bgcolor":"","icon":"desktop_windows","payload":"","payloadType":"str","topic":"topic","topicType":"msg","x":560,"y":540,"wires":[["b0ef8aa7.329d18"]]},{"id":"b0ef8aa7.329d18","type":"exec","z":"3e56901f.b4aac","command":"sudo","addpay":"","append":"systemctl stop kiosk","useSpawn":"false","timer":"","oldrc":false,"name":"","x":750,"y":540,"wires":[[],[],[]]},{"id":"535f46eb.2ce57","type":"ui_text","z":"d8b40c37.7fd748","group":"b418fe9c.51467","order":5,"width":19,"height":3,"name":"","label":"","format":"{{msg.payload}}","layout":"col-center","x":930,"y":200,"wires":[]},{"id":"c12ccf77.bbf168","type":"function","z":"d8b40c37.7fd748","name":"message","func":"msg.payload = messages[Math.floor(Math.random() * messages.length)];\nreturn msg;","outputs":1,"noerr":0,"initialize":"// Code added here will be run once\n// whenever the node is started.\n\nmessages = [\n\"If anything can go wrong, it will.\",\n\"If anything just cannot go wrong, it will anyway.\",\n\"If everything seems to be going well, you have obviously overlooked something\",\n\"Smile . . . tomorrow will be worse.\",\n\"Matter will be damaged in direct proportion to its value.\",\n\"Research supports a specific theory depending on the amount of funds dedicated to it.\",\n\"In nature, nothing is ever right. Therefore, if everything is going right ... something is wrong.\",\n\"It is impossible to make anything foolproof because fools are so ingenious.\",\n\"Everything takes longer than you think.\",\n\"Every solution breeds new problems.\",\n\"The legibility of a copy is inversely proportional to its importance.\",\n\"A falling object will always land where it can do the most damage.\",\n\"A shatterproof object will always fall on the only surface hard enough to crack or break it.\",\n\"The other line always moves faster.\",\n\"In order to get a personal loan, you must first prove you don't need it.\",\n\"Anything you try to fix will take longer and cost you more than you thought.\",\n\"Build a system that even a fool can use, and only a fool will use it.\",\n\"Everyone has a scheme for getting rich that will not work.\",\n\"In any hierarchy, each individual rises to his own level of incompetence, and then remains there.\",\n\"There's never time to do it right, but there's always time to do it over.\",\n\"When in doubt, mumble. When in trouble, delegate.\",\n\"Anything good in life is either illegal, immoral or fattening.\",\n\"Murphy's golden rule: whoever has the gold makes the rules.\",\n\"A Smith & Wesson beats four aces.\",\n\"In case of doubt, make it sound convincing.\",\n\"Never argue with a fool, people might not know the difference.\",\n\"Whatever hits the fan will not be evenly distributed.\",\n\"Where patience fails, force prevails.\",\n\"Just when you think things cannot get any worse, they will.\",\n\"Great ideas are never remembered and dumb statements are never forgotten.\",\n\"When you see light at the end of the tunnel, the tunnel will cave in.\",\n\"Traffic is inversely proportional to how late you are, or are going to be.\",\n\"The probability of being observed is in direct proportion to the stupidity of ones actions.\",\n\"Those who know the least will always know it the loudest.\",\n\"Just because you CAN do something doesn't mean you SHOULD.\",\n\"Chaos always wins, because it's better organized.\",\n\"If at first you don't succeed destroy all evidence that you ever tried.\",\n\"It takes forever to learn the rules and once you've learned them they change again\",\n\"You will find an easy way to do it, after you've finished doing it.\",\n\"Anyone who isn't paranoid simply isn't paying attention.\",\n\"A valuable falling in a hard to reach place will be exactly at the distance of the tip of your fingers.\",\n\"The probability of rain is inversely proportional to the size of the umbrella you carry around with you all day.\",\n\"Nothing is impossible for the man who doesn't have to do it himself.\",\n\"The likelihood of something happening is in inverse proportion to the desirability of it happening.\",\n\"Common Sense Is Not So Common.\",\n\"Power Is Taken... Not Given.\",\n\"Two wrongs don't make a right. It usually takes three or four.\",\n\"The difference between Stupidity and Genius is that Genius has its limits.\",\n\"Those who don't take decisions never make mistakes.\",\n\"Anything that seems right, is putting you into a false sense of security.\",\n\"Its never so bad it couldn't be worse.\",\n\"When saying that things can not possibly get any worse - they will.\",\n\"The person ahead of you in the queue, will have the most complex transaction possible.\",\n\"Logic is a systematic method of coming to the wrong conclusion with confidence.\",\n\"Technology is dominated by those who manage what they do not understand.\",\n\"The opulence of the front office decor varies inversely with the fundamental solvency of the firm.\",\n\"The attention span of a computer is only as long as it electrical cord.\",\n\"Nothing ever gets built on schedule or within budget.\",\n\"The first myth of management is that it exists.\",\n\"A failure will not appear till a unit has passed final inspection.\",\n\"To err is human, but to really foul things up requires a computer.\",\n\"Any sufficiently advanced technology is indistinguishable from magic.\",\n\"Nothing motivates a man more than to see his boss putting in an honest day's work.\",\n\"Some people manage by the book, even though they don't know who wrote the book or even what book.\",\n\"To spot the expert, pick the one who predicts the job will take the longest and cost the most.\",\n\"After all is said and done, a hell of a lot more is said than done.\",\n\"The only perfect science is hind-sight.\",\n\"If an experiment works, something has gone wrong.\",\n\"When all else fails, read the instructions.\",\n\"The degree of technical competence is inversely proportional to the level of management.\",\n\"The remaining work to finish in order to reach your goal increases as the deadline approaches.\",\n\"It is never wise to let a piece of electronic equipment know that you are in a hurry.\",\n\"If you are not thoroughly confused, you have not been thoroughly informed.\",\n\"Standard parts are not.\",\n\"The bolt that is in the most awkward place will always be the one with the tightest thread.\",\n\"In today's fast-moving tech environment, it is a requirement that we forget more than we learn.\",\n\"It is simple to make something complex, and complex to make it simple.\",\n\"If it works in theory, it won't work in practice. If it works in practice it won't work in theory.\",\n\"Any tool dropped will fall where it can cause the most damage.\",\n\"When you finally update to a new technology, is when everyone stop supporting it.\",\n\"If you think you understand science (or computers or women), you're clearly not an expert\",\n\"Technicians are the only ones that don't trust technology.\",\n\"The repairman will have never seen a model quite like yours before.\",\n\"In theory there is no difference between theory and practice, but in practice there is.\",\n\"Never underestimate incompetency.\",\n\"Any given program, when running, is obsolete.\",\n\"Any given program costs more and takes longer each time it is run.\",\n\"If a program is useful, it will have to be changed.\",\n\"If a program is useless, it will have to be documented.\",\n\"Any given program will expand to fill all the available memory.\",\n\"Program complexity grows until it exceeds the capability of the programmer who must maintain it.\",\n\"Adding manpower to a late software project makes it later.\",\n\"No matter how many resources you have, it is never enough.\",\n\"If a program has not crashed yet, it is waiting for a critical moment before it crashes.\",\n\"Software bugs are impossible to detect by anybody except the end user.\",\n\"A failure in a device will never appear until it has passed final inspection.\",\n\"An expert is someone brought in at the last minute to share the blame.\",\n\"A patch is a piece of software which replaces old bugs with new bugs.\",\n\"The chances of a program doing what it's supposed to do is inversely proportional to the number of lines of code used.\",\n\"The longer it takes to download a program the more likely it won't run.\",\n\"It's not a bug, it's an undocumented feature.\",\n\"Bugs mysteriously appear when you say, Watch this!\",\n\"The probability of bugs appearing is directly proportional to the number and importance of people watching.\",\n\"If a project is completed on schedule, it wasn't debugged properly.\",\n\"If it works, it's production. If it doesn't, it's a test.\",\n\"Real programmers don't comment their code. If it was hard to write, it should be hard to understand.\",\n\"A computer that has been on the market for 6 weeks is still usable as a boat anchor.\",\n\"Computers let you waste time efficiently.\",\n\"A pat on the back is only a few inches from a kick in the pants.\",\n\"Don't be irreplaceable, if you can't be replaced, you can't be promoted.\",\n\"It doesn't matter what you do, it only matters what you say you've done and what you say you're going to do.\",\n\"The more crap you put up with, the more crap you are going to get.\",\n\"When the bosses talk about improving productivity, they are never talking about themselves.\",\n\"Mother said there would be days like this, but she never said there would be so many.\",\n\"--> The last person that quit or was fired will be the one held responsible for everything that goes wrong. :-)\",\n\"If it wasn't for the last minute, nothing would get done.\",\n\"The longer the title, the less important the job.\",\n\"If you have a little extra money to blow, something will break, and cost more than that little extra.\",\n\"If the salesperson says, All you have to do is..., you know you're in trouble.\",\n\"When I was a kid my parents moved a lot, but I always found them.\",\n\"Life is short. Smile while you still have teeth.\",\n\"The best way to teach your kids about taxes is by eating 30 percent of their ice cream.\",\n\"I'm writing a book. I've got the page numbers done.\",\n\"I have always wanted to be somebody, but I see now I should have been more specific.\",\n\"Knowledge is like underwear. It is useful to have it, but not necessary to show it off.\",\n\"If a book about failures doesn't sell, is it a success?\",\n\"A lie gets halfway around the world before the truth has a chance to get its pants on.\",\n\"It's okay if you don't like me. Not everyone has good taste.\",\n\"Everything is changing. People are taking the comedians seriously and the politicians as a joke.\",\n\"I like long walks, especially when they are taken by people who annoy me.\",\n\"The only way to keep your health is to eat what you don't want, drink what you don't like, and do what you'd rather not.\",\n\"When nothing is going right, go left.\",\n\"Never miss a good chance to shut up.\",\n\"I'd like to live like a poor man – only with lots of money.\",\n\"My life feels like a test I didn't study for.\",\n\"I don't go crazy. I am crazy. I just go normal from time to time.\",\n\"My bed is a magical place where I suddenly remember everything I forgot to do.\",\n\"I'm actually not funny. I'm just really mean and people think I'm joking.\",\n\"Sometimes I want to go back in time and punch myself in the face.\",\n\"If you are lonely, dim all lights and put on a horror movie. After a while it won't feel like you are alone anymore.\",\n\"Fries or salad? sums up every adult decision you have to make.\",\n\"If we're not meant to have midnight snacks, why is there a light in the fridge.\",\n\"My doctor told me to watch my drinking. Now I drink in front of a mirror.\",\n\"I drive way too fast to worry about cholesterol.\",\n\"As your best friend I'll always pick you up when you fall, after I finish laughing.\",\n\"Some people are like clouds. When they disappear, it's a beautiful day.\",\n\"I'm not arguing. I'm simply explaining why I'm right.\",\n\"No wonder the teacher knows so much; she has the book.\",\n\"The most ineffective workers are systematically moved to the place where they can do the least damage: management.\",\n\"The best way to appreciate your job is to imagine yourself without one.\",\n\"If I had asked people what they wanted, they would have said faster horses. Henry Ford\",\n\"The closest a person ever comes to perfection is when he fills out a job application form.\",\n\"Don't yell at your kids! Lean in real close and whisper, it's much scarier.\",\n\"The quickest way for a parent to get a child's attention is to sit down and look comfortable.\",\n\"I don't know what's more exhausting about parenting: the getting up early, or the acting like you know what you're doing.\",\n\"It just occurred to me that the majority of my diet is made up of the foods that my kid didn't finish.\",\n\"When your children are teenagers, it's important to have a dog so that someone in the house is happy to see you.\",\n\"I never know what to say when people ask me what my hobbies are. I mean, I'm a dad.\",\n\"My wife and I were happy for twenty years. Then we met.\",\n\"Marriage... it's not a word, it's a sentence.\",\n\"Marry a man your own age; as your beauty fades, so will his eyesight.\",\n\"Marriage is the triumph of imagination over intelligence. Second marriage is the triumph of hope over experience.\",\n\"The most terrifying thing any woman can say to me is Notice anything different?\",\n\"When a man brings his wife flowers for no reason, there's a reason.\"\n]","finalize":"","libs":[],"x":740,"y":200,"wires":[["535f46eb.2ce57"]]},{"id":"c1f6829d.a4f97","type":"inject","z":"d8b40c37.7fd748","name":"","props":[],"repeat":"5","crontab":"","once":true,"onceDelay":0.1,"topic":"","x":370,"y":200,"wires":[["c12ccf77.bbf168"]]},{"id":"d96d21ae.439f58","type":"ui_template","z":"d8b40c37.7fd748","group":"b418fe9c.51467","name":"","order":6,"width":0,"height":0,"format":"<style>\n    .md-button {\n        font-size: 42px !important;\n    }\n    .nr-dashboard-widget- {\n        font-size: 24px !important;\n    }    \n</style>","storeOutMessages":true,"fwdInMessages":true,"resendOnRefresh":true,"templateScope":"local","x":340,"y":580,"wires":[[]]},{"id":"c7bdc0f5.437848","type":"inject","z":"d8b40c37.7fd748","name":"","props":[{"p":"payload"},{"p":"topic","vt":"str"}],"repeat":"30","crontab":"","once":true,"onceDelay":0.1,"topic":"","payload":"","payloadType":"date","x":350,"y":400,"wires":[["422e42e0.2e4794"]]},{"id":"422e42e0.2e4794","type":"Bme280","z":"d8b40c37.7fd748","name":"","bus":"1","address":"0x76","topic":"bme280","extra":false,"x":560,"y":400,"wires":[["d4a2c43a.038cb"]]},{"id":"d4a2c43a.038cb","type":"function","z":"d8b40c37.7fd748","name":"","func":"msg.payload.temperature_C = Math.round(msg.payload.temperature_C*10)/10;\nmsg.payload.humidity = Math.round(msg.payload.humidity);\nreturn msg;","outputs":1,"noerr":0,"initialize":"","finalize":"","libs":[],"x":740,"y":400,"wires":[["c07ba115.1b6958","c29fc847.47ba4"]]},{"id":"c07ba115.1b6958","type":"ui_button","z":"d8b40c37.7fd748","name":"Temperature","group":"b418fe9c.51467","order":4,"width":6,"height":2,"passthru":false,"label":"{{msg.payload.temperature_C}} &deg;C","tooltip":"","color":"","bgcolor":"","icon":"fa-thermometer-empty","payload":"","payloadType":"str","topic":"topic","topicType":"msg","x":950,"y":400,"wires":[[]]},{"id":"be0d8698.5af488","type":"inject","z":"d8b40c37.7fd748","name":"","props":[{"p":"payload"},{"p":"topic","vt":"str"}],"repeat":"1","crontab":"","once":true,"onceDelay":0.1,"topic":"","payload":"","payloadType":"date","x":350,"y":300,"wires":[["fd29aa75.f60608","e6b1b53a.2cd788"]]},{"id":"fd29aa75.f60608","type":"simpletime","z":"d8b40c37.7fd748","name":"","mydate":false,"myymd":true,"myyear":false,"mymonth":false,"mymonthn":false,"mydom":false,"mydoy":false,"myday":false,"myhourpm":false,"myhour":false,"mytime":true,"mytimes":false,"myminute":false,"myminutes":false,"mysecond":false,"mymillis":false,"myepoch":false,"myrawdate":false,"mypm":false,"x":730,"y":320,"wires":[["c83333c3.dab24"]]},{"id":"e6b1b53a.2cd788","type":"ui_clock","z":"d8b40c37.7fd748","name":"","group":"b418fe9c.51467","order":2,"width":6,"height":4,"x":930,"y":280,"wires":[]},{"id":"c83333c3.dab24","type":"ui_text","z":"d8b40c37.7fd748","group":"b418fe9c.51467","order":3,"width":6,"height":1,"name":"Date","label":"","format":"{{msg.myymd}}","layout":"col-center","x":930,"y":320,"wires":[]},{"id":"9f1633a2.9389b8","type":"exec","z":"3e56901f.b4aac","command":"sudo reboot now","addpay":"","append":"","useSpawn":"false","timer":"","oldrc":false,"name":"","x":780,"y":460,"wires":[[],[],[]]},{"id":"31a3558b.6b211a","type":"exec","z":"3e56901f.b4aac","command":"sudo shutdown now","addpay":"","append":"","useSpawn":"false","timer":"","oldrc":false,"name":"","x":800,"y":380,"wires":[[],[],[]]},{"id":"fa56bc44.28f36","type":"average-bars","z":"734e8117.dcf29","name":"average-bars","title":"Temperature","period":"day","yMin":"auto","yMax":"auto","showBarsValue":true,"showScaleValue":true,"showLastValue":true,"showAverageValue":true,"showMinimumValue":true,"showMaximumValue":true,"maxBar":30,"topColor":"#0097ff","bottomColor":"#8800ff","unit":"°C","fontColor":"#aaaaaa","barStyle":"Rectangle","decimal":1,"x":570,"y":260,"wires":[["c008dab8.e27b18"]]},{"id":"c008dab8.e27b18","type":"ui_template","z":"734e8117.dcf29","group":"ee517ab4.5dfed","name":"","order":1,"width":19,"height":9,"format":"<div ng-bind-html=\"msg.payload\"></div>","storeOutMessages":true,"fwdInMessages":true,"resendOnRefresh":true,"templateScope":"local","x":740,"y":260,"wires":[[]]},{"id":"7813d7bd.c20a6","type":"link in","z":"734e8117.dcf29","name":"","links":["c29fc847.47ba4"],"x":275,"y":260,"wires":[["b0fb6ccb.853c6"]]},{"id":"c29fc847.47ba4","type":"link out","z":"d8b40c37.7fd748","name":"","links":["7813d7bd.c20a6"],"x":895,"y":460,"wires":[]},{"id":"b0fb6ccb.853c6","type":"function","z":"734e8117.dcf29","name":"","func":"msg.payload = msg.payload.temperature_C;\nreturn msg;","outputs":1,"noerr":0,"initialize":"","finalize":"","libs":[],"x":400,"y":260,"wires":[["fa56bc44.28f36"]]},{"id":"c0fa17fa.0dfa6","type":"function","z":"d8b40c37.7fd748","name":"media","func":"msg.payload = {\n    \"category\":\"Videos\",\n    \"name\": msg.payload[Math.floor(Math.random() * msg.payload.length)],\n    \"play\":true\n};\n\nreturn msg;","outputs":1,"noerr":0,"initialize":"","finalize":"","libs":[],"x":730,"y":140,"wires":[["6d5d5f3d.8d69c8"]]},{"id":"5311c762.1f8978","type":"inject","z":"d8b40c37.7fd748","name":"","props":[],"repeat":"","crontab":"","once":true,"onceDelay":0.1,"topic":"","x":370,"y":60,"wires":[["8b97be65.fc0a68"]]},{"id":"8b97be65.fc0a68","type":"fs-file-lister","z":"d8b40c37.7fd748","name":"","start":"/home/pi/.node-red/lib/ui-media/lib/Videos","pattern":"*.*","folders":"*","hidden":false,"lstype":"files","path":false,"single":true,"depth":0,"stat":false,"showWarnings":false,"x":560,"y":60,"wires":[["dbbb57d0.699fa"]]},{"id":"dbbb57d0.699fa","type":"change","z":"d8b40c37.7fd748","name":"","rules":[{"t":"set","p":"media","pt":"global","to":"payload","tot":"msg"}],"action":"","property":"","from":"","to":"","reg":false,"x":760,"y":60,"wires":[[]]},{"id":"93e47ae6.f2ba6","type":"change","z":"d8b40c37.7fd748","name":"media list","rules":[{"t":"set","p":"payload","pt":"msg","to":"media","tot":"global"}],"action":"","property":"","from":"","to":"","reg":false,"x":560,"y":140,"wires":[["c0fa17fa.0dfa6"]]},{"id":"f2b28086.9b031","type":"inject","z":"d8b40c37.7fd748","name":"","props":[],"repeat":"60","crontab":"","once":true,"onceDelay":"1","topic":"","x":370,"y":140,"wires":[["93e47ae6.f2ba6"]]}]